test/_cfg/artillery.config.yaml
config:
  target: 'http://localhost:6379' 
  phases:
    - duration: 60  # Duration of the test in seconds
      arrivalRate: 1000  # Number of users to simulate per second

scenarios:
  - flow:
      - post:
          url: '/api/wallet/add'  # Replace with your actual API endpoint to test
          json:
            userId: "{{ integer(1, 1000) }}"  # Randomly select a user ID from 1 to 1000
            amount: "{{ integer(1, 10000) }}"